spec/vcr/subscription/update_payment_info.yml

---
http_interactions:
- request:
    method: get
    uri: https://DFLe4nAkwg13WPSwqmWP:X@lootcratetest-braintree.chargify.com/subscriptions/7288425.xml
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/xml; charset=utf-8
      Date:
      - Tue, 05 May 2015 01:19:14 GMT
      Etag:
      - '"d3f5609c4bf3f63099d0240e3026361f"'
      P3p:
      - CP="NOI ADM DEV PSAi COM NAV OUR OTRo STP IND DEM"
      Server:
      - nginx + Phusion Passenger
      Set-Cookie:
      - _chargify_session=BAh7CEkiD3Nlc3Npb25faWQGOgZFVEkiJWQ2ZjY3MmUyZDJjNTg1Y2YyM2QwODA5ZWE3MWJiMDQ5BjsAVEkiF3NlbGxlcl9jcmVkZW50aWFscwY7AEZJIgGAYjA1Y2Q0MzgxYWNkZjRkMDg2Nzg4ZTY4NDJlYjY5OTA5N2YxYmU0ZWI0ZWZmZmQzMzMxZTRiNTdhNTNiOTIwM2QwZDJhZDM5N2Y4NzUwYjU5MzY3NDg3YWRiODg4OGUyNWIzN2JiNDFjZTZjZjAxNzY0MDgxNjMwNzE5MTg1OTcGOwBGSSIac2VsbGVyX2NyZWRlbnRpYWxzX2lkBjsARmkCADI%3D--54fc01725b24a88e4a057b1ea30079495c7c9616;
        domain=.chargify.com; path=/; secure; HttpOnly
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger
      X-Rack-Cache:
      - miss
      X-Ratelimit-Limit:
      - '1000000'
      X-Ratelimit-Remaining:
      - '999903'
      X-Ratelimit-Reset:
      - '1430870400'
      X-Request-Id:
      - 3457eba5-6cf0-4563-b460-87e8406d1e7a
      X-Runtime:
      - '0.100624'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription>
          <activated_at type="datetime">2014-12-17T19:54:59-05:00</activated_at>
          <balance_in_cents type="integer">0</balance_in_cents>
          <cancel_at_end_of_period type="boolean" nil="true"/>
          <canceled_at type="datetime" nil="true"/>
          <cancellation_message nil="true"/>
          <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
          <current_period_ends_at type="datetime">2015-06-18T12:56:11-04:00</current_period_ends_at>
          <expires_at type="datetime" nil="true"/>
          <id type="integer">7288425</id>
          <next_assessment_at type="datetime">2015-06-18T12:56:11-04:00</next_assessment_at>
          <next_product_id type="integer" nil="true"/>
          <payment_collection_method>automatic</payment_collection_method>
          <snap_day nil="true"/>
          <state>active</state>
          <trial_ended_at type="datetime" nil="true"/>
          <trial_started_at type="datetime" nil="true"/>
          <updated_at type="datetime">2014-12-18T13:24:16-05:00</updated_at>
          <current_period_started_at type="datetime">2014-12-18T11:56:09-05:00</current_period_started_at>
          <previous_state>active</previous_state>
          <signup_payment_id type="integer">78649329</signup_payment_id>
          <signup_revenue>21.11</signup_revenue>
          <delayed_cancel_at nil="true"/>
          <coupon_code nil="true"/>
          <total_revenue_in_cents type="integer">11555</total_revenue_in_cents>
          <product_price_in_cents type="integer">10599</product_price_in_cents>
          <product_version_number type="integer">1</product_version_number>
          <payment_type>credit_card</payment_type>
          <referral_code nil="true"/>
          <current_billing_amount_in_cents type="integer">11553</current_billing_amount_in_cents>
          <customer>
            <address>3108 LASHBROOK AVENUE</address>
            <address_2 nil="true"/>
            <city>EL MONTE</city>
            <country>US</country>
            <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
            <email>howhmn@gmail.com</email>
            <first_name>HAI</first_name>
            <id type="integer">7149195</id>
            <last_name>Nguyen</last_name>
            <organization nil="true"/>
            <phone nil="true"/>
            <portal_customer_created_at type="datetime" nil="true"/>
            <portal_invite_last_accepted_at type="datetime" nil="true"/>
            <portal_invite_last_sent_at type="datetime" nil="true"/>
            <reference nil="true"/>
            <state>CA</state>
            <updated_at type="datetime">2014-12-17T19:54:58-05:00</updated_at>
            <verified type="boolean">false</verified>
            <zip>91733</zip>
          </customer>
          <product>
            <accounting_code>6month</accounting_code>
            <archived_at type="datetime" nil="true"/>
            <created_at type="datetime">2014-09-15T08:33:51-04:00</created_at>
            <description>Six Month Recurring Subscription to Loot Crate! (US Only) </description>
            <expiration_interval type="integer" nil="true"/>
            <expiration_interval_unit>never</expiration_interval_unit>
            <handle>6-month-subscription</handle>
            <id type="integer">3552901</id>
            <initial_charge_in_cents type="integer" nil="true"/>
            <interval type="integer">6</interval>
            <interval_unit>month</interval_unit>
            <name>Six Month Subscription</name>
            <price_in_cents type="integer">11370</price_in_cents>
            <request_credit_card type="boolean">true</request_credit_card>
            <require_credit_card type="boolean">true</require_credit_card>
            <return_params></return_params>
            <taxable type="boolean">true</taxable>
            <trial_interval type="integer" nil="true"/>
            <trial_interval_unit>month</trial_interval_unit>
            <trial_price_in_cents type="integer" nil="true"/>
            <update_return_url></update_return_url>
            <updated_at type="datetime">2015-02-05T14:21:18-05:00</updated_at>
            <version_number type="integer">2</version_number>
            <product_family>
              <accounting_code nil="true"/>
              <description>Monthly Subscription Design</description>
              <handle>1993521</handle>
              <id type="integer">442941</id>
              <name>Loot Crate's Monthly Box</name>
            </product_family>
            <public_signup_pages type="array">
              <public_signup_page>
                <id type="integer">107659</id>
                <return_url>http://polar-waters-8702.herokuapp.com/payment_completed/index?pid=2</return_url>
                <url>http://lootcratetest-braintree.chargify.com/subscribe/670d09b91afa/6-month-subscription</url>
              </public_signup_page>
            </public_signup_pages>
          </product>
          <credit_card>
            <billing_address>3108 LASHBROOK AVENUE</billing_address>
            <billing_address_2 nil="true"/>
            <billing_city>EL MONTE</billing_city>
            <billing_country>US</billing_country>
            <billing_state>CA</billing_state>
            <billing_zip>91733</billing_zip>
            <card_type>bogus</card_type>
            <current_vault>bogus</current_vault>
            <customer_id type="integer">7149195</customer_id>
            <customer_vault_token nil="true"/>
            <expiration_month type="integer">12</expiration_month>
            <expiration_year type="integer">2014</expiration_year>
            <first_name>HAI</first_name>
            <id type="integer">4739705</id>
            <last_name>Nguyen</last_name>
            <masked_card_number>XXXX-XXXX-XXXX-1</masked_card_number>
            <vault_token>1</vault_token>
            <payment_type>credit_card</payment_type>
          </credit_card>
        </subscription>
    http_version:
  recorded_at: Tue, 05 May 2015 01:19:14 GMT
- request:
    method: get
    uri: https://DFLe4nAkwg13WPSwqmWP:X@lootcratetest-braintree.chargify.com/subscriptions/31782.xml
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/xml; charset=utf-8
      Date:
      - Tue, 05 May 2015 01:19:14 GMT
      Etag:
      - '"d3f5609c4bf3f63099d0240e3026361f"'
      P3p:
      - CP="NOI ADM DEV PSAi COM NAV OUR OTRo STP IND DEM"
      Server:
      - nginx + Phusion Passenger
      Set-Cookie:
      - _chargify_session=BAh7CEkiD3Nlc3Npb25faWQGOgZFVEkiJWQ2ZjY3MmUyZDJjNTg1Y2YyM2QwODA5ZWE3MWJiMDQ5BjsAVEkiF3NlbGxlcl9jcmVkZW50aWFscwY7AEZJIgGAYjA1Y2Q0MzgxYWNkZjRkMDg2Nzg4ZTY4NDJlYjY5OTA5N2YxYmU0ZWI0ZWZmZmQzMzMxZTRiNTdhNTNiOTIwM2QwZDJhZDM5N2Y4NzUwYjU5MzY3NDg3YWRiODg4OGUyNWIzN2JiNDFjZTZjZjAxNzY0MDgxNjMwNzE5MTg1OTcGOwBGSSIac2VsbGVyX2NyZWRlbnRpYWxzX2lkBjsARmkCADI%3D--54fc01725b24a88e4a057b1ea30079495c7c9616;
        domain=.chargify.com; path=/; secure; HttpOnly
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger
      X-Rack-Cache:
      - miss
      X-Ratelimit-Limit:
      - '1000000'
      X-Ratelimit-Remaining:
      - '999903'
      X-Ratelimit-Reset:
      - '1430870400'
      X-Request-Id:
      - 3457eba5-6cf0-4563-b460-87e8406d1e7a
      X-Runtime:
      - '0.100624'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription>
          <activated_at type="datetime">2014-12-17T19:54:59-05:00</activated_at>
          <balance_in_cents type="integer">0</balance_in_cents>
          <cancel_at_end_of_period type="boolean" nil="true"/>
          <canceled_at type="datetime" nil="true"/>
          <cancellation_message nil="true"/>
          <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
          <current_period_ends_at type="datetime">2015-06-18T12:56:11-04:00</current_period_ends_at>
          <expires_at type="datetime" nil="true"/>
          <id type="integer">7288425</id>
          <next_assessment_at type="datetime">2015-06-18T12:56:11-04:00</next_assessment_at>
          <next_product_id type="integer" nil="true"/>
          <payment_collection_method>automatic</payment_collection_method>
          <snap_day nil="true"/>
          <state>active</state>
          <trial_ended_at type="datetime" nil="true"/>
          <trial_started_at type="datetime" nil="true"/>
          <updated_at type="datetime">2014-12-18T13:24:16-05:00</updated_at>
          <current_period_started_at type="datetime">2014-12-18T11:56:09-05:00</current_period_started_at>
          <previous_state>active</previous_state>
          <signup_payment_id type="integer">78649329</signup_payment_id>
          <signup_revenue>21.11</signup_revenue>
          <delayed_cancel_at nil="true"/>
          <coupon_code nil="true"/>
          <total_revenue_in_cents type="integer">11555</total_revenue_in_cents>
          <product_price_in_cents type="integer">10599</product_price_in_cents>
          <product_version_number type="integer">1</product_version_number>
          <payment_type>credit_card</payment_type>
          <referral_code nil="true"/>
          <current_billing_amount_in_cents type="integer">11553</current_billing_amount_in_cents>
          <customer>
            <address>3108 LASHBROOK AVENUE</address>
            <address_2 nil="true"/>
            <city>EL MONTE</city>
            <country>US</country>
            <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
            <email>howhmn@gmail.com</email>
            <first_name>HAI</first_name>
            <id type="integer">7149195</id>
            <last_name>Nguyen</last_name>
            <organization nil="true"/>
            <phone nil="true"/>
            <portal_customer_created_at type="datetime" nil="true"/>
            <portal_invite_last_accepted_at type="datetime" nil="true"/>
            <portal_invite_last_sent_at type="datetime" nil="true"/>
            <reference nil="true"/>
            <state>CA</state>
            <updated_at type="datetime">2014-12-17T19:54:58-05:00</updated_at>
            <verified type="boolean">false</verified>
            <zip>91733</zip>
          </customer>
          <product>
            <accounting_code>6month</accounting_code>
            <archived_at type="datetime" nil="true"/>
            <created_at type="datetime">2014-09-15T08:33:51-04:00</created_at>
            <description>Six Month Recurring Subscription to Loot Crate! (US Only) </description>
            <expiration_interval type="integer" nil="true"/>
            <expiration_interval_unit>never</expiration_interval_unit>
            <handle>6-month-subscription</handle>
            <id type="integer">3552901</id>
            <initial_charge_in_cents type="integer" nil="true"/>
            <interval type="integer">6</interval>
            <interval_unit>month</interval_unit>
            <name>Six Month Subscription</name>
            <price_in_cents type="integer">11370</price_in_cents>
            <request_credit_card type="boolean">true</request_credit_card>
            <require_credit_card type="boolean">true</require_credit_card>
            <return_params></return_params>
            <taxable type="boolean">true</taxable>
            <trial_interval type="integer" nil="true"/>
            <trial_interval_unit>month</trial_interval_unit>
            <trial_price_in_cents type="integer" nil="true"/>
            <update_return_url></update_return_url>
            <updated_at type="datetime">2015-02-05T14:21:18-05:00</updated_at>
            <version_number type="integer">2</version_number>
            <product_family>
              <accounting_code nil="true"/>
              <description>Monthly Subscription Design</description>
              <handle>1993521</handle>
              <id type="integer">442941</id>
              <name>Loot Crate's Monthly Box</name>
            </product_family>
            <public_signup_pages type="array">
              <public_signup_page>
                <id type="integer">107659</id>
                <return_url>http://polar-waters-8702.herokuapp.com/payment_completed/index?pid=2</return_url>
                <url>http://lootcratetest-braintree.chargify.com/subscribe/670d09b91afa/6-month-subscription</url>
              </public_signup_page>
            </public_signup_pages>
          </product>
          <credit_card>
            <billing_address>3108 LASHBROOK AVENUE</billing_address>
            <billing_address_2 nil="true"/>
            <billing_city>EL MONTE</billing_city>
            <billing_country>US</billing_country>
            <billing_state>CA</billing_state>
            <billing_zip>91733</billing_zip>
            <card_type>bogus</card_type>
            <current_vault>bogus</current_vault>
            <customer_id type="integer">7149195</customer_id>
            <customer_vault_token nil="true"/>
            <expiration_month type="integer">12</expiration_month>
            <expiration_year type="integer">2014</expiration_year>
            <first_name>HAI</first_name>
            <id type="integer">4739705</id>
            <last_name>Nguyen</last_name>
            <masked_card_number>XXXX-XXXX-XXXX-1</masked_card_number>
            <vault_token>1</vault_token>
            <payment_type>credit_card</payment_type>
          </credit_card>
        </subscription>
    http_version:
  recorded_at: Tue, 05 May 2015 01:19:14 GMT
- request:
    method: put
    uri: https://DFLe4nAkwg13WPSwqmWP:X@lootcratetest-braintree.chargify.com/subscriptions/7288425.xml
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription>
          <activated_at type="dateTime">2014-12-17T16:54:59-08:00</activated_at>
          <balance_in_cents type="integer">0</balance_in_cents>
          <cancel_at_end_of_period nil="true"/>
          <canceled_at nil="true"/>
          <cancellation_message nil="true"/>
          <created_at type="dateTime">2014-12-17T16:54:58-08:00</created_at>
          <current_period_ends_at type="dateTime">2015-06-18T09:56:11-07:00</current_period_ends_at>
          <expires_at nil="true"/>
          <id type="integer">7288425</id>
          <next_assessment_at type="dateTime">2015-06-18T09:56:11-07:00</next_assessment_at>
          <next_product_id nil="true"/>
          <payment_collection_method>automatic</payment_collection_method>
          <snap_day nil="true"/>
          <state>active</state>
          <trial_ended_at nil="true"/>
          <trial_started_at nil="true"/>
          <updated_at type="dateTime">2014-12-18T10:24:16-08:00</updated_at>
          <current_period_started_at type="dateTime">2014-12-18T08:56:09-08:00</current_period_started_at>
          <previous_state>active</previous_state>
          <signup_payment_id type="integer">78649329</signup_payment_id>
          <signup_revenue>21.11</signup_revenue>
          <delayed_cancel_at nil="true"/>
          <coupon_code nil="true"/>
          <total_revenue_in_cents type="integer">11555</total_revenue_in_cents>
          <product_price_in_cents type="integer">10599</product_price_in_cents>
          <product_version_number type="integer">1</product_version_number>
          <payment_type>credit_card</payment_type>
          <referral_code nil="true"/>
          <current_billing_amount_in_cents type="integer">11553</current_billing_amount_in_cents>
          <payment_profile_attributes>
            <first_name>New</first_name>
            <last_name>Person</last_name>
            <expiration_month type="integer">1</expiration_month>
            <expiration_year type="integer">2025</expiration_year>
            <cvv>123</cvv>
            <full_number>2</full_number>
            <billing_address>new address line 1</billing_address>
            <billing_address_2>new address line 2</billing_address_2>
            <billing_city>Cairo</billing_city>
            <billing_state>KY</billing_state>
            <billing_zip>99999</billing_zip>
            <billing_country>US</billing_country>
          </payment_profile_attributes>
        </subscription>
    headers:
      Content-Type:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/xml; charset=utf-8
      Date:
      - Tue, 05 May 2015 01:19:15 GMT
      Etag:
      - '"c3a13cc0298f738a6aa7b9f4c8893d09"'
      Location:
      - https://lootcratetest-braintree.chargify.com/subscriptions/7288425
      P3p:
      - CP="NOI ADM DEV PSAi COM NAV OUR OTRo STP IND DEM"
      Server:
      - nginx + Phusion Passenger
      Set-Cookie:
      - _chargify_session=BAh7CEkiD3Nlc3Npb25faWQGOgZFVEkiJWU3YzVmY2QzNTQxOTE4YjYxMDk1ZWM5OTVkNTM5MDE0BjsAVEkiF3NlbGxlcl9jcmVkZW50aWFscwY7AEZJIgGAZjcxOTczNTk4MmNhYjNjOTY0ZThmNTk5ZGExYjJiNjczNmVhNDkxOTJhYjU1ZGNhMThlNDkyNDEyNDZkMmU4OWI0NWVjYjYyZjI0YWQ3MTU3YjBiNWY0YjcwZDM1Nzg3ZDhmYmJkYzc0MGIwNWJjMDJlMGY0ZWQ3OTY2NDdmNDQGOwBGSSIac2VsbGVyX2NyZWRlbnRpYWxzX2lkBjsARmkCADI%3D--860bf37666ff9d32659ed16b38b013d5c5f17830;
        domain=.chargify.com; path=/; secure; HttpOnly
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger
      X-Rack-Cache:
      - invalidate, pass
      X-Ratelimit-Limit:
      - '1000000'
      X-Ratelimit-Remaining:
      - '999902'
      X-Ratelimit-Reset:
      - '1430870400'
      X-Request-Id:
      - 27f28cf7-cade-4cf0-ac86-6536859ad10a
      X-Runtime:
      - '0.181646'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '5077'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription>
          <activated_at type="datetime">2014-12-17T19:54:59-05:00</activated_at>
          <balance_in_cents type="integer">0</balance_in_cents>
          <cancel_at_end_of_period type="boolean" nil="true"/>
          <canceled_at type="datetime" nil="true"/>
          <cancellation_message nil="true"/>
          <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
          <current_period_ends_at type="datetime">2015-06-18T12:56:11-04:00</current_period_ends_at>
          <expires_at type="datetime" nil="true"/>
          <id type="integer">7288425</id>
          <next_assessment_at type="datetime">2015-06-18T12:56:11-04:00</next_assessment_at>
          <next_product_id type="integer" nil="true"/>
          <payment_collection_method>automatic</payment_collection_method>
          <snap_day nil="true"/>
          <state>active</state>
          <trial_ended_at type="datetime" nil="true"/>
          <trial_started_at type="datetime" nil="true"/>
          <updated_at type="datetime">2015-05-04T21:19:15-04:00</updated_at>
          <current_period_started_at type="datetime">2014-12-18T11:56:09-05:00</current_period_started_at>
          <previous_state>active</previous_state>
          <signup_payment_id type="integer">78649329</signup_payment_id>
          <signup_revenue>21.11</signup_revenue>
          <delayed_cancel_at nil="true"/>
          <coupon_code nil="true"/>
          <total_revenue_in_cents type="integer">11555</total_revenue_in_cents>
          <product_price_in_cents type="integer">10599</product_price_in_cents>
          <product_version_number type="integer">1</product_version_number>
          <payment_type>credit_card</payment_type>
          <referral_code nil="true"/>
          <customer>
            <address>3108 LASHBROOK AVENUE</address>
            <address_2 nil="true"/>
            <city>EL MONTE</city>
            <country>US</country>
            <created_at type="datetime">2014-12-17T19:54:58-05:00</created_at>
            <email>howhmn@gmail.com</email>
            <first_name>HAI</first_name>
            <id type="integer">7149195</id>
            <last_name>Nguyen</last_name>
            <organization nil="true"/>
            <phone nil="true"/>
            <portal_customer_created_at type="datetime" nil="true"/>
            <portal_invite_last_accepted_at type="datetime" nil="true"/>
            <portal_invite_last_sent_at type="datetime" nil="true"/>
            <reference nil="true"/>
            <state>CA</state>
            <updated_at type="datetime">2014-12-17T19:54:58-05:00</updated_at>
            <verified type="boolean">false</verified>
            <zip>91733</zip>
          </customer>
          <product>
            <accounting_code>6month</accounting_code>
            <archived_at type="datetime" nil="true"/>
            <created_at type="datetime">2014-09-15T08:33:51-04:00</created_at>
            <description>Six Month Recurring Subscription to Loot Crate! (US Only) </description>
            <expiration_interval type="integer" nil="true"/>
            <expiration_interval_unit>never</expiration_interval_unit>
            <handle>6-month-subscription</handle>
            <id type="integer">3552901</id>
            <initial_charge_in_cents type="integer" nil="true"/>
            <interval type="integer">6</interval>
            <interval_unit>month</interval_unit>
            <name>Six Month Subscription</name>
            <price_in_cents type="integer">11370</price_in_cents>
            <request_credit_card type="boolean">true</request_credit_card>
            <require_credit_card type="boolean">true</require_credit_card>
            <return_params></return_params>
            <taxable type="boolean">true</taxable>
            <trial_interval type="integer" nil="true"/>
            <trial_interval_unit>month</trial_interval_unit>
            <trial_price_in_cents type="integer" nil="true"/>
            <update_return_url></update_return_url>
            <updated_at type="datetime">2015-02-05T14:21:18-05:00</updated_at>
            <version_number type="integer">2</version_number>
            <product_family>
              <accounting_code nil="true"/>
              <description>Monthly Subscription Design</description>
              <handle>1993521</handle>
              <id type="integer">442941</id>
              <name>Loot Crate's Monthly Box</name>
            </product_family>
            <public_signup_pages type="array">
              <public_signup_page>
                <id type="integer">107659</id>
                <return_url>http://polar-waters-8702.herokuapp.com/payment_completed/index?pid=2</return_url>
                <url>http://lootcratetest-braintree.chargify.com/subscribe/670d09b91afa/6-month-subscription</url>
              </public_signup_page>
            </public_signup_pages>
          </product>
          <credit_card>
            <billing_address>new address line 1</billing_address>
            <billing_address_2>new address line 2</billing_address_2>
            <billing_city>Cairo</billing_city>
            <billing_country>US</billing_country>
            <billing_state>KY</billing_state>
            <billing_zip>99999</billing_zip>
            <card_type>bogus</card_type>
            <current_vault>bogus</current_vault>
            <customer_id type="integer">7149195</customer_id>
            <customer_vault_token nil="true"/>
            <expiration_month type="integer">1</expiration_month>
            <expiration_year type="integer">2025</expiration_year>
            <first_name>New</first_name>
            <id type="integer">4739705</id>
            <last_name>Person</last_name>
            <masked_card_number>XXXX-XXXX-XXXX-2</masked_card_number>
            <vault_token>2</vault_token>
            <payment_type>credit_card</payment_type>
          </credit_card>
        </subscription>
    http_version:
  recorded_at: Tue, 05 May 2015 01:19:15 GMT
recorded_with: VCR 2.9.3
